# -*- mode: org; -*-
#+TITLE: Docker Zombies and Orphans
#+HTML_HEAD:      <style type="text/css">pre.src.src-c { background: DarkSlateGray; }</style>

* Outside Any Container

Let's establish what our utility will see when we run it in the host
environment.  It will create a child and a grandchild, the child will
exit, and then the grandchild will ask for its parent pid.

By the time the grandchild gets around to doing a =getppid=, it will
already have been adopted by some reaper process.

#+BEGIN_src sh :results value :exports both
./a.out
#+END_src

#+RESULTS:
| which      |   PID | parent |
| Child      | 26525 |  26524 |
| Root       | 26524 |  26523 |
| Grandchild | 26526 |   2713 |


We see that the grandchild has been reparented to process 2713.
That turns out to be a subreaper run by the window manager on my box.

If this were run on a server, it would likely pid 1 (init) instead.

* Processes as seen inside the Container

Inside the container, we see our own processes, with pid, parent pid.
Because we told Docker to start /bin/bash as the container's top-level process,
it appears as PID 1.

#+BEGIN_src sh :results value :exports both
docker run --rm -v `pwd`:/src ubuntu /src/a.out
#+END_src

#+results:
| which      | PID | parent |
| Child      |   5 |      1 |
| Root       |   1 |      0 |
| Grandchild |   6 |      1 |


Outside the container, we can see those same processes, but they have different pids.
Our top-level process, which inside the container is pid 1, is actually pid 1821 when viewed from outside the container.


